app/controllers/books_controller.rb

  def create
     @book = Book.new(book_params)
     if @book.save
      redirect_to book_path(@book.id), notice: 'Book was successfully created.'
     else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "s"], ["body", "s"], ["created_at", "2020-03-18 02:32:00.147715"], ["updated_at", "2020-03-18 02:32:00.147715"]]
SELECT "books".* FROM "books"